src/main/resources/sample_requests/get_countries.xml

<!-- This file is not a part of the project itself. It's just a sample SOAP request to send -->
<!-- curl -u foo:bar [double_hyphen]header "content-type: text/xml" -d @sample_soap_request.xml http://localhost:8080/ws -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:ns1="http://hello/SOAP/countries">
   <soapenv:Header/>
   <soapenv:Body>
      <ns1:getCountriesRequest>
		<ns1:currency>EUR</ns1:currency>
		<ns1:minPopulation>70100200</ns1:minPopulation>
	  </ns1:getCountriesRequest>
   </soapenv:Body>
</soapenv:Envelope>
